read_verilog -formal /root/chisel_with_ste/CAM_m_n_build/CAM_m_n.sv
prep -top CAM_m_n
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/CAM_m_n_build/CAM_m_n2.btor2

