read_verilog -formal /root/chisel_with_ste/RISCVCPUv2.sv
prep -top RISCVCPUv2
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/RISCVCPUv2.btor2

