read_verilog -formal /root/chisel_with_ste/Parity_build/Parity.sv
prep -top Parity
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/Parity_build/Parity.btor2

