read_verilog -formal /WCSTE/CAM_m_n_build/CAM_m_n.sv
prep -top CAM_m_n
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /WCSTE/CAM_m_n_build/CAM_m_n2.btor2

