read_verilog -formal /root/chisel_with_ste/SMatMul_build/SMatMul.sv
prep -top SMatMul
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/SMatMul_build/SMatMul2.btor2

