read_verilog -formal /root/chisel_with_ste/RWSmem_build/RWSmem.sv
prep -top RWSmem
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/RWSmem_build/RWSmem2.btor2

