read_verilog -formal /root/chisel_with_ste/RISCVCPUv2_build/RISCVCPUv2.sv
prep -top RISCVCPUv2
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/RISCVCPUv2_build/RISCVCPUv22.btor2

