read_verilog -formal /root/chisel_with_ste/MultMan_build/MultMan.sv
prep -top MultMan
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/MultMan_build/MultMan2.btor2

