read_verilog -formal /root/chisel_with_ste/self_build/self.sv
prep -top self
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /root/chisel_with_ste/self_build/self2.btor2

