read_verilog -formal /WCSTE/RISCVCPUv2_build/RISCVCPUv2.sv
prep -top RISCVCPUv2
flatten
memory 
hierarchy -check
setundef -undriven -init -expose
write_btor /WCSTE/RISCVCPUv2_build/RISCVCPUv22.btor2

